Revit 2027 API
SeparatorItem Class
 A class representing a context menu separator.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.MenuItem
 Autodesk.Revit.UI.SeparatorItem
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SeparatorItem : MenuItem
Public Class SeparatorItem
	Inherits MenuItem
public ref class SeparatorItem : public MenuItem
type SeparatorItem =
    class
        inherit MenuItem
    end
The SeparatorItem type exposes the following members.
Constructors
Name | Description
SeparatorItem |  Default constructor.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from MenuItem)
Top
Methods
Name | Description
Dispose
(Inherited from MenuItem)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 A separator can be added between menu items when needed.
See Also
Reference
Autodesk.Revit.UI Namespace